60000/60000 [==============================] - 21s 347us/sample - loss: 0.0460 - sparse_categorical_accuracy: 0.9852 - mse: 27.3923 - mae: 4.3737 - val_loss: 0.0426 - val_sparse_categorical_accuracy: 0.9862 - val_mse: 27.3384 - val_mae: 4.3630
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 24, 24, 32)        832       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 12, 12, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 64)          0         
_________________________________________________________________
flatten (Flatten)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 128)               131200    
_________________________________________________________________
dense_1 (Dense)              (None, 84)                10836     
_________________________________________________________________
dense_2 (Dense)              (None, 10)                850       
=================================================================
Total params: 194,982
Trainable params: 194,982
Non-trainable params: 0
_________________________________________________________________
libpng warning: iCCP: cHRM chunk does not match sRGB
libpng warning: iCCP: cHRM chunk does not match sRGB

Process finished with exit code 0
